onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Меляков Д. 12.02.26   "EDT командная разработка"
	НовыйЭлементФормы = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "Объект.КонтактноеЛицо";
	НовыйЭлементФормы. Заголовок = "Контактное лицо";
		
	НоваяГруппаФормы = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),Элементы.ГруппаШапкаЛево);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	
	ЭлементформыСогласованнаяСкидка = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),НоваяГруппаФормы);
	ЭлементформыСогласованнаяСкидка.Вид = ВидполяФормы.ПолеВвода;
	ЭлементформыСогласованнаяСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ЭлементформыСогласованнаяСкидка.Заголовок = "Согласованная скидка";
	ЭлементформыСогласованнаяСкидка.УстановитьДействие("ПриИзменении","ПриИзмененииСкидки");
	
	
	КомандаПересчетаТЧ = Команды.Добавить("ПересчетСуммыСУчетомСкидки"); 
	КомандаПересчетаТЧ.Заголовок = "Пересчет суммы с учетом скидки";
	КомандаПересчетаТЧ.Действие = "ПересчетТабличнойЧастиСУчетомСкидки";
	
	
	КнопкаПересчетаТЧ = Элементы.Добавить("ПересчетСуммыСУчетомСкидки", Тип("КнопкаФормы"),НоваяГруппаФормы);
	КнопкаПересчетаТЧ.ИмяКоманды = "ПересчетСуммыСУчетомСкидки";
	КнопкаПересчетаТЧ.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаПересчетаТЧ.Картинка = БиблиотекаКартинок.Перечитать;
	КнопкаПересчетаТЧ.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	// -- Меляков Д. 12.02.26 
	
	
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПересчетТабличнойЧастиСУчетомСкидки(Команда)
 //++ Меляков Д. 12.02.26 "Командная работа EDT"

 	КоличествоЗаписейВТовары = Объект.Товары.Количество();
	КолочествоЗапичейВУслуги = Объект.Услуги.Количество();
	
	Если КоличествоЗаписейВТовары <> 0 или КолочествоЗапичейВУслуги <> 0 Тогда
		ПересчетТабЧастиСУчетомСкидки();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены табличные части ""Товары"" и/или ""Услуги"". Пересчет невозможен";
		Сообщение.Сообщить();
	КонецЕсли;	
//-- Меляков Д. 12.02.26	
Конецпроцедуры



&НаКлиенте
Асинх Процедура ВопросПользователюАсинх(); 
//++ Меляков Д. 12.02.26 "Командная работа EDT"
	//ОтветНаВопрос = Ждать ВопросАсинх("Изменен процент скики. Пересчитать таблицы товаров и услуг ?",РежимДиалогаВопрос.ДаНет);
	Обещание = ВопросАсинх("Изменен процент скики. Пересчитать таблицы товаров и услуг ?",РежимДиалогаВопрос.ДаНет);
	ОтветНаВопрос = Ждать Обещание;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ПересчетТабЧастиСУчетомСкидки();
	КонецЕсли;	

КонецПроцедуры 
	
&НаКлиенте
Процедура ПриИзмененииСкидки()
//++ Меляков Д. 12.02.26 "Командная работа EDT"
	КоличествоЗаписейВТовары = Объект.Товары.Количество();
	КолочествоЗапичейВУслуги = Объект.Услуги.Количество();

	Если КоличествоЗаписейВТовары <> 0 или КолочествоЗапичейВУслуги <> 0 Тогда
		ВопросПользователюАсинх();
	Иначе
		Возврат;
	КонецЕсли;  
КонецПроцедуры 


&НаКлиенте
Процедура ПересчетТабЧастиСУчетомСкидки()
 //++ Меляков Д. 12.02.26 "Командная работа EDT"
 
 	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(СтрокаТовара); 
	КонецЦикла;	
	
	Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(СтрокаУслуги); 
	КонецЦикла	
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
//++ Меляков Д. 12.02.26 "Командная работа EDT"
	
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество)*(1- Объект.СогласованнаяСкидка/100);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуДокумента()

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры



#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
